{
  "data": [
    {
      "id": 1,
      "name": "coastal city",
      "category": "Home Décor",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/1.jpg",
      "price": 39.99,
      "description": "Amethyst has a very high spiritual vibration and is especially calming for the mind. I use it extensively in spiritual practice for meditation and healing. Amethyst is particularly well known to provide a protective shield around the aura against psychic attack or negativity. It can even be used to help a dying person make a peaceful transition."
    },
    {
      "id": 2,
      "name": "ancient capital",
      "category": "Home Décor",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/2.jpg",
      "price": 36.35,
      "description": "We wanted to make a Christmas stocking robust and big enough to be filled with goodies but also to look fabulous hanging on the fireplace as a decoration year after year. We only use good quality designer fabrics."
    },
    {
      "id": 3,
      "name": "industrial city",
      "category": "Home Décor",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/3.jpg",
      "price": 19.35,
      "description": "A beautiful stained wood sign is made from pine wood. This rustic sign adds warmth to a room tucked on a shelf or hung on the wall. Also a perfect gift for so many occasions."
    },
    {
      "id": 4,
      "name": "municipality under the central government",
      "category": "Home Décor",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/4.jpg",
      "price": 20.75,
      "description": "The Gypsy is a free spirited dream catcher that’s name speaks for itself. The feathers and macramé hanging from the hoop flow freely in the night air, catching any bad dreams that my come across your room. By day, the Gypsy creates a noticeable positive energy that will add a sense of free spirit to your home."
    },
    {
      "id": 5,
      "name": "geographical location",
      "category": "Home Décor",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/5.jpg",
      "price": 56.00,
      "description": "Bring together state park adventures and travels with this interactive themed push pin map to create memories that will last a lifetime. One of our Design Gurus would love to work one-on-one with you to customize this personalized interactive map which helps you keep those memories alive by displaying all of the places you’ve visited. After each trip, place a pin on the location you’ve just returned from and use the printable map tags to add photos and special moments to the map… you won’t be able to keep from smiling as you remember your favorite part of that trip, every time you see the map!"
    },
    {
      "id": 6,
      "name": "historical sites",
      "category": "Home Décor",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/6.jpg",
      "price": 19.42,
      "description": "Marbled Bulbasaur planter made from Jesmonite. Jesmonite is a durable, waterproof material that looks and feels like stone. Sealed with a glossy finish."
    },
    {
      "id": 7,
      "name": "long history",
      "category": "Hats & Caps",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/7.jpg",
      "price": 10.00,
      "description": "A lightweight slouch beanie. The fabric makes it less bulky compared to traditional knitted beanies so they can be worn all year. "
    },
    {
      "id": 8,
      "name": "modern city",
      "category": "Hats & Caps",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/8.jpg",
      "price": 18.00,
      "description": "Got that Jeep Hair and Don't Care?! Pair it with this super cute distressed trucker hat!"
    },
    {
      "id": 9,
      "name": "metropolis",
      "category": "Hats & Caps",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/9.jpg",
      "price": 19.95,
      "description": "For guys who need more space."
    },
    {
      "id": 10,
      "name": "capital",
      "category": "Hats & Caps",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/10.jpg",
      "price": 20.44,
      "description": "This hat is made in two layers of fuchsia fleece. The materials are fleece, thread and wire, so it's completely vegan."
    },
    {
      "id": 11,
      "name": "provincial capital",
      "category": "Hats & Caps",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/11.jpg",
      "price": 15.00,
      "description": "This is an adorable little girls crochet linen beanie hat with a three layer cream colored flower. Super soft and stretchy any little girl would love to wear it! "
    },
    {
      "id": 12,
      "name": "ancient city/historical city",
      "category": "Cell Phone",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/12.jpg",
      "price": 15.00,
      "description": "Personalized wood iPhone 6 case is a unique and Personalized way to have a one of a kind phone case. Get one for yourself or give it as a gift, either way, this case is sure to get some looks. The wood is exquisitely engraved with your Personalized touch."
    },
    {
      "id": 13,
      "name": "remote city",
      "category": "Cell Phone",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/13.jpg",
      "price": 26.50,
      "description": "Reclaimed wood acoustic amplifier for smartphones/mobile devices - currently available for iPhone 4S, 5S, 6, 6+ and Galaxy III, S4, S5, S6, S6 Edge (some Galaxy models need rotated for best amplification and the Boom Boom Box may work with other makes and models not listed)."
    },
    {
      "id": 14,
      "name": "tourist city",
      "category": "Cell Phone",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/14.jpg",
      "price": 30.00,
      "description": "An amazingly clear and loud MP3 amp! This thing is cool! It includes a patch cable, ON/OFF toggle, and more general coolness than you can handle."
    },
    {
      "id": 15,
      "name": "ancient building",
      "category": "Cell Phone",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/15.jpg",
      "price": 14.99,
      "description": "This is my Chic design is printed made by UV technology for Motorola phones! "
    },
    {
      "id": 16,
      "name": "peaceful",
      "category": "Cell Phone",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/16.jpg",
      "price": 13.99,
      "description": "They Are Very Durable And Also Stylish At The Same Time. They Protect EDGES, And Cover CORNERS Of Your Phone And Metal Casing Of The BACK Of Your Phone And Helps Against Screen Cracks. These Cases Are Not Cheap Sticker Cases They Will Withstand A Lot Of Usage With Out Peeling, Cracking, Or Fading"
    },
    {
      "id": 17,
      "name": "pace of life",
      "category": "Camera",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/17.jpg",
      "price": 25.00,
      "description": "Design with colorful tribal patterns expressing the spirit of courage and curiosity."
    },
    {
      "id": 18,
      "name": "local people",
      "category": "Camera",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/18.jpg",
      "price": 99.00,
      "description": "This little camera is both highly collectible and usable. It was one of the first instant film cameras designed and produced by Polaroid in their now highly familiar box type format. It was first released in the mid 1970’s."
    },
    {
      "id": 19,
      "name": "commercial center",
      "category": "Camera",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/19.jpg",
      "price": 9.00,
      "description": "Classic and simple instax mini album for keeping you own memories."
    },
    {
      "id": 20,
      "name": "landscape",
      "category": "Camera",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/20.jpg",
      "price": 12.94,
      "description": "Need to capture the children's attention and get them focused on the camera for that perfect shot. Then these fun critters are just what you need. "
    },
    {
      "id": 21,
      "name": "enchanting",
      "category": "Camera",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/21.jpg",
      "price": 125.00,
      "description": "This utterly beautiful old Kodak Six-16 camera is just dying for a special space in your bookshelves. Made in the 1930s, It is barely weathered, with the outer black casing still in great condition. I have no idea if it is working or not, but all components seem to be functional. It is in very good vintage condition. The black bellows are still in great shape. Nothing can detract from the awesomeness of this camera as a display piece, it truly is magnificent, especially for a photography lover like myself! Also, this sweet vintage camera comes with the original rustic leather carrying case, which is very cool!"
    },
    {
      "id": 22,
      "name": "cultural sites",
      "category": "Camera",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/22.jpg",
      "price": 39.00,
      "description": "keep your camera and equipment secure in your favorite bag plus loads of other things you need for the day. No need for an extra bag."
    },
    {
      "id": 23,
      "name": "exquisite sculptures",
      "category": "Music",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/23.jpg",
      "price": 12.00,
      "description": "This listing is for one pair of personalized engraved 16\" maple drumsticks and are the perfect gift for any drummer or music lover."
    },
    {
      "id": 24,
      "name": "magnificent buildings",
      "category": "Music",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/24.jpg",
      "price": 8.50,
      "description": "Please mention your desired text/design to be engraved in the “note to Pickslay’s Woodworking” which will be an option after you add the item to your cart."
    },
    {
      "id": 25,
      "name": "remains",
      "category": "Music",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/25.jpg",
      "price": 129.50,
      "description": "Solid Mahogany with Flamed Maple Veneer Top"
    },
    {
      "id": 26,
      "name": "scenic spots",
      "category": "Music",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/26.jpg",
      "price": 29.50,
      "description": "We started by making one of these for a friend who is a high school band director. We have been making and shipping them to choir directors, pit orchestra conductors, school band directors, music teachers and a number of maestros."
    },
    {
      "id": 27,
      "name": "tourists",
      "category": "Music",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/27.jpg",
      "price": 98.70,
      "description": "Premium tan baseball-glove leather guitar strap with intricate embroidered detail and adjustable tail end. Leather is incredibly soft and very durable."
    },
    {
      "id": 28,
      "name": "local food",
      "category": "Music",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/28.jpg",
      "price": 19.99,
      "description": "Play the blues or even a little rock-n-roll Music on this genuine Hohner, personalized engraved harmonica. Makes nice personalized engraved gifts for men, ringbearer, groomsmen gifts, kids gifts, Christmas, women, groomsman and all music lovers."
    },
    {
      "id": 29,
      "name": "local scenery",
      "category": "Music",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/29.jpg",
      "price": 35.99,
      "description": "Gypsy Tambourine. Gypsy Soul Tambourine. Boho Gypsy Tamborine. \"Blame My Gypsy Soul\" festival tambourine. Inspired by the gypsy soul of the iconic Stevie Nicks, this tambourine would be a wonderful addition to your bohemian, hippie, or gypsy nest. Play it or display it! Be unique at the next festival!"
    },
    {
      "id": 30,
      "name": "natural landscape",
      "category": "Jewelry",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/30.jpg",
      "price": 7.00,
      "description": "Angel wing charms"
    },
    {
      "id": 31,
      "name": "happy memories",
      "category": "Jewelry",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/31.jpg",
      "price": 3.00,
      "description": "Stainless expandable bracelet. Made from THICKER 1.8 mm wire."
    },
    {
      "id": 32,
      "name": "spicy food",
      "category": "Jewelry",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/32.jpg",
      "price": 4.00,
      "description": "30 x pieces Swarovski Crystal AB (chameleon) or Clear Crystal - round flat back"
    },
    {
      "id": 33,
      "name": "gourmet",
      "category": "Jewelry",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/33.jpg",
      "price": 14.90,
      "description": "These are gorgeous green amethyst rose-cut cabs. light green color, very crisp and clean."
    },
    {
      "id": 34,
      "name": "shipping goods",
      "category": "Jewelry",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/34.jpg",
      "price": 11.95,
      "description": "This listing for 2 pcs Hair Combs, Antique Bronze Flower Tray Hair Comb ... Perfect for resin cabochon ... you can choose your quantity for cheaper."
    },

    {
      "id": 35,
      "name": "traditional food",
      "category": "Clothing",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/-1.jpg",
      "price": 24.99,
      "description": "It's the holiday season, 1990. A young boy, Kevin Stein is getting ready to travel to Boca to visit his bubbie with his family. Unfortunately for him, they leave earlier than anticipated - now this is plausible because everyone knows us Jews are never on time. Ever. Especially when traveling in groups, and that's increased exponentially when traveling to the airport together. So anyway they leave earlier than expected, Kevin slept in anticipating a late departure per usual only to find that he has the whole house to himself. What does he do? Fuckin' rage. That's the plot for Home Alone Jew."
    },
    {
      "id": 36,
      "name": "ferry",
      "category": "Clothing",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/-2.jpg",
      "price": 38.35,
      "description": "Gorgeous kimono draped jacket. All sheer mesh. Embellished with dazzling sequins and embroidery with a floral design. Open front. Draped style that will fit many sizes. Light weight kimono."
    },
    {
      "id": 37,
      "name": "splendid scenery",
      "category": "Clothing",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/-3.jpg",
      "price": 13.99,
      "description": "THE BEST QUALITY SOCKS!! We use real merino wool & it's not scratchy/itchy..just so so sooo soft! They'll instantly become your favorite socks. With a timeless design, they are sure to never go out of fashion."
    },
    {
      "id": 38,
      "name": "signpost",
      "category": "Clothing",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/-4.jpg",
      "price": 27.75,
      "description": "Style and comfort are the perfect words to describe this unbelievably cute hoodie. The light sweater knit gives it an incredibly soft hand that drapes beautifully. It’s a can’t miss for any season."
    },
    {
      "id": 39,
      "name": "broadened streets",
      "category": "Clothing",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/-5.jpg",
      "price": 299.00,
      "description": "Fancy tailoring is what this red military coat is all about. The cinched in waist will give you a wonderful silhouette whilst the knee length will give you just enough coverage to stay super cozy. Perfect to wear with knee high winter boots."
    },
    {
      "id": 40,
      "name": "local tourism",
      "category": "Clothing",
      "image": "https://gitee.com/zhongjh/MvvmIbatis/raw/master/server/images/-6.jpg",
      "price": 18.95,
      "description": "The essential long sleeve tee gets a fresh update with a soft poly-viscose blend, draped silhouette and wide neckline that can be worn on or off the shoulder."
    }
  ],
  "errorCode": 0,
  "errorMsg": ""
}